Repository: dev-longshun/glint
Catalog: Glint/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: New ports: %d (web) and %d (terminal). Copy the new link and key to reconnect.
zh_hans: 新端口：%d（网页）和 %d（终端）。请复制新链接和密钥重新连接。

source: New terminals
zh_hans: 新建终端

source: New workspace
zh_hans: 新建工作区

source: Next Tab
zh_hans: 下一个标签页

source: Next Workspace
zh_hans: 下一工作区

source: Next change
zh_hans: 下一个改动

source: No Matches
zh_hans: 无匹配

source: No archived workspaces
zh_hans: 没有已归档的工作区

source: No changes
zh_hans: 无改动

source: No changes after filter
zh_hans: 应用过滤后无改动

source: No changes to review
zh_hans: 没有可审阅的改动

source: No diff for this file
zh_hans: 该文件无差异

source: No matches
zh_hans: 没有匹配的字体

source: No repo binding. Fastest path.
zh_hans: 不绑定仓库。最快路径。

source: No update packages found on GitHub Releases.
zh_hans: GitHub Releases 上未找到更新包。

source: No working directory
zh_hans: 无工作目录

source: Normalize modified keys
zh_hans: 规整带修饰按键

source: Not Now
zh_hans: 暂不

source: Not checked yet
zh_hans: 尚未检查

source: Not detected
zh_hans: 未检测到

source: Not installed
zh_hans: 未安装

source: Not installed.
zh_hans: 未安装。

source: Not wired
zh_hans: 未接入

source: Nothing parked yet.
zh_hans: 目前还没有停放的工作区。

source: Notifications
zh_hans: 通知

source: OK
zh_hans: 好

source: OMP detected — install the extension to show its status.
zh_hans: 已检测到 OMP — 安装扩展以显示其状态。

source: OMP not detected on this Mac.
zh_hans: 此 Mac 上未检测到 OMP。

source: Off — no network ports are bound.
zh_hans: 已关闭 — 未监听任何网络端口。

source: Off — no socket bound, no external access.
zh_hans: 已关闭 —— 未绑定 socket,外部无法访问。

source: Off — terminal sessions stay live.
zh_hans: 已关闭——终端会话会保持运行。

source: Only fires while Glint is in the background. Pops a banner in Notification Center when an agent needs approval, finishes, or fails. Silent — the chime stays the audio cue.
zh_hans: 仅在 Glint 处于后台时触发。agent 需要批准、完成或出错时在通知中心弹出横幅。静默——声音仍由提示音负责。

source: Only inactive shell prompts are eligible.
zh_hans: 仅未聚焦的 shell 提示符会被释放。

source: Only this Mac (127.0.0.1) can connect.
zh_hans: 仅本机（127.0.0.1）可连接。

source: Opacity & blur
zh_hans: 透明度与模糊

source: Open
zh_hans: 打开

source: Open Glint settings
zh_hans: 打开 Glint 设置

source: Open Workspace
zh_hans: 打开工作区

source: Open a checkout
zh_hans: 打开一个检出

source: Open a new pane on the right
zh_hans: 在右侧打开一个新面板

source: Open a pane running %@
zh_hans: 打开一个运行 %@ 的窗格

source: Open a tab running %@
zh_hans: 打开一个运行 %@ 的标签页

source: Open a workspace on an existing checkout (not isolated).
zh_hans: 在已有检出上打开工作区(不隔离)。

source: Open a workspace running %@
zh_hans: 打开一个运行 %@ 的工作区

source: Open the focused pane's directory in Finder
zh_hans: 在访达中打开当前面板所在目录

source: Open with
zh_hans: 打开方式

source: OpenCode detected — install the plugin to show its status.
zh_hans: 已检测到 OpenCode —— 安装插件即可显示其状态。

source: OpenCode not detected on this Mac.
zh_hans: 本机未检测到 OpenCode。

source: Opens directly on the current checkout. For isolation across parallel agents, choose Local Worktree.
zh_hans: 直接在当前检出上打开。若要在并行 agent 间隔离,请选择本地工作树。

source: Our CI currently ships every DMG as a pre-release (0.1.27-dev.N). Keep this on to receive them.
zh_hans: 当前 CI 会把每个 DMG 标为预发布（0.1.27-dev.N）。保持开启才能收到这些构建。

source: Panes
zh_hans: 面板

source: Parked workspaces
zh_hans: 已停放的工作区

source: Paste
zh_hans: 粘贴

source: Paste potentially unsafe text?
zh_hans: 粘贴可能不安全的文本?

source: Path
zh_hans: 路径

source: Path of the bash reporter that posts to Glint's local socket.
zh_hans: 向 Glint 本地 socket 上报的 bash 脚本路径。

source: Phase 2
zh_hans: 第二阶段

source: Pi detected — install the extension to show its status.
zh_hans: 已检测到 Pi — 安装扩展即可显示其状态。

source: Pi not detected on this Mac.
zh_hans: 本机未检测到 Pi。

source: Pick a git repository first.
zh_hans: 请先选择一个 git 仓库。

source: Pick a git repository to continue.
zh_hans: 选择一个 git 仓库以继续。

source: Pick a source: plain / repo / worktree
zh_hans: 选择来源:纯终端 / 仓库 / 工作树

source: Plain Terminal
zh_hans: 纯终端

source: Play a chime when an agent is waiting for your approval in a background workspace.
zh_hans: 后台工作区中代理等待批准时播放提示音。

source: Play a softer chime when a background agent finishes its turn.
zh_hans: 后台代理完成任务时播放一个轻柔的提示音。

source: Play an error tone when a background agent's turn ends in an API error.
zh_hans: 当后台工作区的 agent 因 API 错误终止时播放提示音。

source: Plugin file
zh_hans: 插件文件

source: Plugin installed into your OpenCode plugins directory.
zh_hans: 插件已安装到你的 OpenCode 插件目录。

source: Port %d is already in use.
zh_hans: 端口 %d 已被占用。

source: Port %d is already in use. Resetting will generate a new key and ports, disconnect browsers, and invalidate old links.
zh_hans: 端口 %d 已被占用。重置会生成新密钥和端口、断开浏览器，并使旧链接失效。

source: Port conflict
zh_hans: 端口冲突

source: Press keys…
zh_hans: 请按键…

source: Preview
zh_hans: 试听

source: Previous Tab
zh_hans: 上一个标签页

source: Previous Workspace
zh_hans: 上一工作区

source: Previous change
zh_hans: 上一个改动

source: Progress
zh_hans: 进度

source: Quit
zh_hans: 退出

source: Quit & Install
zh_hans: 退出并安装

source: Quit Glint
zh_hans: 退出 Glint

source: Quit Glint?
zh_hans: 退出 Glint?

source: Quits Glint, installs the downloaded update, and reopens it.
zh_hans: 退出 Glint，安装已下载的更新并重新打开。

source: Quota
zh_hans: 额度

source: Quota unavailable
zh_hans: 额度不可用

source: Re-select the workspace you had focused when Glint last quit.
zh_hans: 重新选中上次退出 Glint 时聚焦的工作区。

source: Reachable from any network this Mac joins (least secure).
zh_hans: 本机加入的任何网络均可访问（最不安全）。

source: Ready — copy a session link to another browser.
zh_hans: 已就绪 — 可复制会话链接到其他浏览器。

source: Receive beta updates
zh_hans: 接收 Beta 更新

source: Receive pre-release builds.
zh_hans: 接收预发布版本。

source: Recommended
zh_hans: 推荐

source: Refresh
zh_hans: 刷新

source: Refresh interfaces
zh_hans: 刷新网卡列表

source: Registered via ~/.omp/agent/settings.json; only reports when Glint's pane environment variables are present.
zh_hans: 通过 ~/.omp/agent/settings.json 注册；仅在存在 Glint 的 pane 环境变量时上报。

source: Release after
zh_hans: 多久后释放

source: Releases inactive shell sessions and recreates them in the same folder when you return. Running commands, SSH sessions, agents, tmux, and the focused terminal are never touched.
zh_hans: 释放闲置的 shell 会话，并在你返回时于同一目录重新创建。正在运行的命令、SSH 会话、Agent、tmux 和当前聚焦的终端都不会受到影响。

source: Remove Hook
zh_hans: 移除钩子

source: Remove this Codex Home from Glint
zh_hans: 从 Glint 移除此 Codex Home

source: Removed from Glint, but hook cleanup failed: %@
zh_hans: 已从 Glint 移除,但钩子清理失败:%@

source: Removes the worktree directory from disk. Closing a workspace only drops the UI — this deletes files and can't be undone.
zh_hans: 从磁盘移除工作树目录。关闭工作区只是收起界面——这会删除文件且无法撤销。

source: Rename
zh_hans: 重命名

source: Rename Workspace
zh_hans: 重命名工作区

source: Rename the current workspace
zh_hans: 重命名当前工作区

source: Render all terminal text in the family's bold variant.
zh_hans: 所有终端文本都用字体的 Bold 切片渲染。

source: Reopen Terminal
zh_hans: 重新打开终端

source: Reopens in the same folder.
zh_hans: 将在同一目录重新打开。

source: Repository
zh_hans: 仓库

source: Reset All Shortcuts
zh_hans: 重置全部快捷键

source: Reset access key and ports?
zh_hans: 重置访问密钥和端口？

source: Reset key and ports
zh_hans: 重置密钥和端口

source: Reset to default
zh_hans: 恢复默认

source: Restarting…
zh_hans: 正在重启…

source: Restore each pane's previous scrollback (with colors) on launch. Running processes don't resume — only the text is restored.
zh_hans: 启动时恢复每个窗格之前的滚动历史(含颜色)。运行中的进程不会恢复 —— 仅恢复文本。

source: Restore last workspace
zh_hans: 恢复上次的工作区

source: Restore terminal history
zh_hans: 恢复终端历史

source: Resume session on launch
zh_hans: 启动时恢复会话

source: Resumed Claude panes relaunch with `--dangerously-skip-permissions`, even if the pane was started without it or its flags weren't recorded (e.g. right after upgrading).
zh_hans: 恢复的 Claude 窗格一律带 `--dangerously-skip-permissions` 启动，即使该窗格当初没带这个参数，或参数没被记录下来（例如刚升级完）。

source: Resumed Codex panes relaunch with `--dangerously-bypass-approvals-and-sandbox`, even if the pane was started without it or its flags weren't recorded (e.g. right after upgrading).
zh_hans: 恢复的 Codex 窗格一律带 `--dangerously-bypass-approvals-and-sandbox` 启动，即使该窗格当初没带这个参数，或参数没被记录下来（例如刚升级完）。

source: Resumed Grok panes relaunch with `--always-approve`, even if the pane was started without it or its flags weren't recorded (e.g. right after upgrading).
zh_hans: 恢复的 Grok 窗格一律带 `--always-approve` 启动，即使该窗格当初没带这个参数，或参数没被记录下来（例如刚升级完）。

source: Retry
zh_hans: 重试

source: Return to launch · Esc to cancel
zh_hans: 回车启动 · Esc 取消

source: Reveal Worktree in Finder
zh_hans: 在访达中显示工作树

source: Reveal in Finder
zh_hans: 在访达中显示

source: Reveal in Finder at repository root
zh_hans: 在访达中显示仓库根目录

source: Review Changes at repository root
zh_hans: 在仓库根目录审查变更

source: Review Changes…
zh_hans: 审阅改动…

source: Review this workspace's changes
zh_hans: 审阅此工作区的改动

source: Roomy
zh_hans: 宽敞

source: Run Selection
zh_hans: 执行选中项

source: SSH Project
zh_hans: SSH 项目

source: Scrollback
zh_hans: 滚动

source: Scrollback is kept per-pane. Increasing this raises memory usage.
zh_hans: 滚动记录按面板独立保存,增大此值会增加内存占用。

source: Scrollback size
zh_hans: 滚动记录大小

source: Search
zh_hans: 搜索

source: Search fonts
zh_hans: 搜索字体

source: Search themes…
zh_hans: 搜索主题…

source: See what changed in this version.
zh_hans: 查看这个版本有哪些变化。

source: Select All
zh_hans: 全选

source: Selected interface is no longer available. Pick another or use All interfaces.
zh_hans: 所选网卡已不可用。请另选一个或使用“全部网卡”。

source: Serves Glint's bundled browser terminal on this Mac for trusted LAN or VPN use. The copied link or access key grants terminal input; traffic is not TLS-encrypted. Off by default.
zh_hans: 在这台 Mac 上提供 Glint 内置的浏览器终端，供可信的局域网或 VPN 使用。复制的链接或访问密钥可直接输入终端；流量未使用 TLS 加密。默认关闭。

source: Sets the highlight color across selection, focus rings, and active states.
zh_hans: 用于选中、焦点环和活跃状态的高亮色。

source: Settings
zh_hans: 设置

source: Settings (⌘,)
zh_hans: 设置 (⌘,)

source: Settings…
zh_hans: 设置…

source: Shell keybindings
zh_hans: Shell 按键绑定

source: Shell only
zh_hans: 仅终端

source: Shortcuts
zh_hans: 快捷键

source: Show All
zh_hans: 显示全部

source: Show Dock badge for agent attention
zh_hans: Agent 需要关注时显示 Dock 角标

source: Show Sidebar
zh_hans: 显示侧栏

source: Show Whitespace
zh_hans: 显示空白

source: Show agent status in the sidebar?
zh_hans: 在侧栏显示 agent 状态?

source: Show macOS notification for agent attention
zh_hans: 后台 agent 需要关注时弹出 macOS 通知

source: Show or hide the workspace sidebar
zh_hans: 显示或隐藏工作区侧栏

source: Show the compacting state on workspace cards when context overflows.
zh_hans: 上下文溢出时,在工作区卡片上显示压缩状态。

source: Show the worktree directory
zh_hans: 显示工作树目录

source: Show upstream commits
zh_hans: 显示上游新提交

source: Show usage in sidebar
zh_hans: 在侧栏显示额度

source: Show your most recent matching command in faint text after the cursor as you type. Press → or End to accept.
zh_hans: 输入时在光标后用浅色显示最近一条匹配的历史命令。按 → 或 End 接受。

source: Shows how many commits chenbstack/glint has that this fork hasn't merged yet, next to New Workspace.
zh_hans: 在「新建工作区」旁显示上游 chenbstack/glint 有多少个本 fork 尚未合并的提交。

source: Sidebar and toolbar
zh_hans: 侧栏与工具栏

source: Sidebar density
zh_hans: 侧栏密度

source: Sidebar vibrancy
zh_hans: 侧栏毛玻璃

source: Signed in via `grok login`, but team plans don't expose usage numbers on xAI's billing surface — showing the weekly window's reset only.
zh_hans: 已通过 `grok login` 登录，但团队套餐在 xAI 计费接口上不提供用量数字 —— 仅显示每周窗口的重置倒计时。

source: Size
zh_hans: 字号

source: Something is still running in it and will be terminated.
zh_hans: 其中仍有任务在运行,关闭后会被终止。

source: Something is still running in them and will be terminated.
zh_hans: 其中仍有任务在运行,关闭后会被终止。

source: Sort
zh_hans: 排序

source: Sort by Modified
zh_hans: 按修改时间排序

source: Sort by Name
zh_hans: 按名称排序

source: Sound
zh_hans: 音效

source: Sound on error
zh_hans: 出错时提示音

source: Sound on permission request
zh_hans: 等待批准时播放提示音

source: Sound on turn complete
zh_hans: 任务完成时播放提示音

source: Spacing between workspace cards.
zh_hans: 工作区卡片之间的间距。

source: Split
zh_hans: 并排

source: Split Horizontal
zh_hans: 横向分屏

source: Split Right · %@
zh_hans: 向右分屏 · %@

source: Split Vertical
zh_hans: 纵向分屏

source: Split pane
zh_hans: 分屏

source: Stable
zh_hans: 稳定版

source: Stack a new pane below
zh_hans: 在下方堆叠一个新面板

source: Start from (base)
zh_hans: 起点(base)

source: Start with the sidebar hidden. ⌃⌘S to toggle.
zh_hans: 启动时隐藏侧栏。⌘\ 切换。

source: Start with the sidebar hidden. ⌘/ to toggle.
zh_hans: 启动时隐藏侧栏。⌘/ 切换。

source: Start with the sidebar hidden. ⌘\ to toggle.
zh_hans: 启动时隐藏侧栏。⌘\ 切换。

source: Starting the local web server…
zh_hans: 正在启动本地网页服务器…

source: Startup
zh_hans: 启动

source: Startup, layout, updates
zh_hans: 启动、布局、更新

source: Status
zh_hans: 状态

source: Style
zh_hans: 样式

source: Switch the Dock icon. "Default" keeps the Liquid Glass icon on macOS 26; the other accents are static icons.
zh_hans: 切换程序坞（Dock）中的图标。「默认」在 macOS 26 上保留 Liquid Glass 玻璃图标；其余配色为静态图标。

source: System
zh_hans: 系统

source: System default
zh_hans: 跟随系统

source: Tabs
zh_hans: 标签页

source: Terminal
zh_hans: 终端

source: Terminal and interface share one palette — recolor both at once.
zh_hans: 终端与界面共用一套配色,一键换肤。

source: Terminal content area
zh_hans: 终端内容区域

source: Terminal failed to start
zh_hans: 终端启动失败

source: Terminal opacity
zh_hans: 终端透明度

source: That branch already exists — choose another name.
zh_hans: 该分支已存在 —— 请换一个名称。

source: That branch name isn’t a valid git ref.
zh_hans: 分支名不是合法的 git 引用。

source: That directory is already configured.
zh_hans: 该目录已配置。

source: The hook configuration cannot be encoded as JSON.
zh_hans: 钩子配置无法编码为 JSON。

source: The new version is ready. Quit Glint to finish installing.
zh_hans: 新版本已就绪，请退出 Glint 完成安装。

source: The new worktree is ready, but copying the uncommitted changes failed. They remain in your original checkout.
zh_hans: 新工作树已就绪,但复制未提交改动失败。这些改动仍保留在你的原始检出里。

source: The text contains newlines or control characters, which may execute commands immediately.
zh_hans: 文本包含换行或控制字符,粘贴后可能立即执行命令。

source: Theme
zh_hans: 主题

source: Theme, accent, glass
zh_hans: 主题、强调色、毛玻璃

source: Time without focus.
zh_hans: 未聚焦的持续时间。

source: Toggle Sidebar
zh_hans: 切换侧栏

source: Toolbar vibrancy
zh_hans: 工具栏毛玻璃

source: Total workspaces stored locally.
zh_hans: 本地存储的工作区总数。

source: Turns vibrancy on or off for the sidebar and toolbar. Off gives a flat look — useful on older Macs.
zh_hans: 为侧栏和工具栏开启或关闭毛玻璃。关闭后呈现扁平外观,在旧款 Mac 上更流畅。

source: Type a command or workspace…
zh_hans: 输入命令或工作区…

source: UPSTREAM
zh_hans: 上游

source: Unarchive
zh_hans: 取消归档

source: Unarchive returns a workspace to the sidebar and selects it. Delete is permanent.
zh_hans: 取消归档会把工作区放回侧栏并选中它。删除不可恢复。

source: Uncommitted
zh_hans: 未提交

source: Uncommitted changes in base: %lld.
zh_hans: base 有 %lld 处未提交改动。

source: Uncommitted changes in base: %lld. The worktree is cut from the base's HEAD — those changes stay in your original checkout and won't carry over.
zh_hans: base 有 %lld 处未提交改动。工作树从 base 的 HEAD 切出——这些改动留在你的原始检出里,不会带过去。

source: Underline
zh_hans: 下划线

source: Unified
zh_hans: 统一

source: Uninstall
zh_hans: 卸载

source: Update available
zh_hans: 有可用更新

source: Update available: %@
zh_hans: 有可用更新：%@

source: Update channel
zh_hans: 更新通道

source: Update failed
zh_hans: 更新失败

source: Updates
zh_hans: 更新

source: Usage off
zh_hans: 未开启

source: Use an absolute path or a path starting with ~.
zh_hans: 请使用绝对路径或以 ~ 开头的路径。

source: Used for all panes. Falls back to SF Mono.
zh_hans: 用于所有面板,缺失时回退到 SF Mono。

source: Used when the main font is missing CJK glyphs.
zh_hans: 主字体缺中日韩字形时使用。

source: Uses the existing checkout in place.
zh_hans: 就地使用已有检出。

source: Verifying download…
zh_hans: 正在校验下载…

source: Version
zh_hans: 版本

source: View
zh_hans: 查看

source: View as Combined List
zh_hans: 合并列表

source: View as List
zh_hans: 列表显示

source: View as Tree
zh_hans: 树状显示

source: View on GitHub
zh_hans: 在 GitHub 上查看

source: Visible only when the palette is open.
zh_hans: 仅在命令面板打开时生效。

source: WORKSPACE
zh_hans: 工作区

source: WORKSPACES
zh_hans: 工作区

source: Waiting for your approval
zh_hans: 等待你的批准

source: Warn before pasting multi-line text
zh_hans: 粘贴多行文本前先提示

source: Web remote control
zh_hans: 网页远程控制

source: Web remote control unavailable
zh_hans: 网页远程控制不可用

source: Web remote port conflict
zh_hans: 网页远程控制端口冲突

source: What's New
zh_hans: 更新内容

source: When Glint reopens, each pane that was running Antigravity at last quit is resumed via `agy --conversation <conversation-id>` — so multiple agy panes in one workspace land back in their own conversations. Falls back to `agy --continue` for panes whose conversation id wasn't captured.
zh_hans: Glint 重新打开时，上次退出时正在运行 Antigravity 的窗格会通过 `agy --conversation <conversation-id>` 恢复 —— 同一工作区里的多个 agy 窗格会回到各自的会话，不会挤到最近一个上。未捕获到会话 id 的窗格退回 `agy --continue`。

source: When Glint reopens, each pane that was running Claude at last quit is resumed via `claude --resume <session-id>` — so multiple Claude panes in one workspace land back in their own sessions, not all collapsed onto the most recent one. Falls back to `claude --continue` for panes whose session id wasn't captured.
zh_hans: Glint 重新打开时，上次退出前在跑 Claude 的窗格会用 `claude --resume <session-id>` 各自恢复——同一工作区里多个 Claude 窗格不会再被合并到同一个最近会话。没抓到 session id 的窗格回退到 `claude --continue`。

source: When Glint reopens, each pane that was running Codex at last quit is resumed via `codex resume <session-id>` — so multiple Codex panes in one workspace land back in their own sessions. Falls back to `codex resume --last` for panes whose session id wasn't captured.
zh_hans: Glint 重新打开时，上次退出前在跑 Codex 的窗格会用 `codex resume <session-id>` 各自恢复——同一工作区里多个 Codex 窗格不会再被合并到同一个会话。没抓到 session id 的窗格回退到 `codex resume --last`。

source: When Glint reopens, each pane that was running Devin at last quit is resumed via `devin --resume <session-id>` — so multiple Devin panes in one workspace land back in their own sessions. Falls back to `devin --continue` for panes whose session id wasn't captured.
zh_hans: Glint 重新打开时，上次退出前在跑 Devin 的窗格会用 `devin --resume <session-id>` 各自恢复——同一工作区里多个 Devin 窗格不会再被合并到同一个会话。没抓到 session id 的窗格回退到 `devin --continue`。

source: When Glint reopens, each pane that was running Grok at last quit is resumed via `grok --resume <session-id>` — so multiple Grok panes in one workspace land back in their own sessions. Falls back to `grok --continue` for panes whose session id wasn't captured.
zh_hans: Glint 重新打开时，上次退出时正在运行 Grok 的每个窗格会通过 `grok --resume <session-id>` 恢复，因此同一工作区里的多个 Grok 窗格会回到各自会话。未捕获到 session id 的窗格会回退到 `grok --continue`。

source: When Glint reopens, each pane that was running OMP at last quit is resumed via `omp -r <session-id>` — so multiple OMP panes in one workspace land back in their own sessions. Falls back to `omp -c` for panes whose session id wasn't captured.
zh_hans: Glint 重新打开时，上次退出时在跑 OMP 的每个 pane 会通过 `omp -r <session-id>` 恢复会话，多个 OMP pane 各自回到自己的会话。未捕获 session id 时回退为 `omp -c`。

source: When Glint reopens, each pane that was running OpenCode at last quit is resumed via `opencode --session <session-id>` — so multiple OpenCode panes in one workspace land back in their own sessions. Falls back to `opencode --continue` for panes whose session id wasn't captured.
zh_hans: Glint 重新打开时，上次退出前在跑 OpenCode 的窗格会用 `opencode --session <session-id>` 各自恢复——同一工作区里多个 OpenCode 窗格不会再被合并到同一个会话。没抓到 session id 的窗格回退到 `opencode --continue`。

source: When Glint reopens, each pane that was running pi at last quit is resumed via `pi --session-id <session-id>` — so multiple pi panes in one workspace land back in their own sessions. Falls back to `pi --continue` for panes whose session id wasn't captured.
zh_hans: Glint 重新打开时,上次退出前正在运行 pi 的每个窗格会通过 `pi --session-id <session-id>` 恢复 —— 这样同一工作区里的多个 pi 窗格会回到各自的会话。未捕获到 session id 的窗格回退到 `pi --continue`。

source: When on, ⌘T / ⌘D / ⌘N and the + button pop a chooser so a new tab, pane, or workspace can start in an agent. Off opens a plain shell.
zh_hans: 开启后,⌘T / ⌘D / ⌘N 和 + 按钮会弹出选择器,让新建的标签页、窗格或工作区直接在某个 Agent 中启动。关闭则打开普通终端。

source: Window
zh_hans: 窗口

source: Without TLS, encryption only blocks passive sniffing. An active attacker on this network can replace the web client and capture the access key or terminal input.
zh_hans: 未使用 TLS 时，加密仅能防止被动嗅探。同一网络中的主动攻击者可以替换网页客户端，窃取访问密钥或终端输入。

source: Workspace
zh_hans: 工作区

source: Workspace 1
zh_hans: 工作区 1

source: Workspace 2
zh_hans: 工作区 2

source: Workspace 3
zh_hans: 工作区 3

source: Workspace 4
zh_hans: 工作区 4

source: Workspace 5
zh_hans: 工作区 5

source: Workspace 6
zh_hans: 工作区 6

source: Workspace 7
zh_hans: 工作区 7

source: Workspace 8
zh_hans: 工作区 8

source: Workspace 9
zh_hans: 工作区 9

source: Workspaces
zh_hans: 工作区

source: Worktree created without your changes
zh_hans: 工作树已创建,但未带上你的改动

source: Worktree git status
zh_hans: 工作树 git 状态

source: Worktree location
zh_hans: 工作树位置

source: Writes the bindings to ~/.config/glint/ and adds a single source line to ~/.zshrc (and ~/.bashrc if present) so modified keys behave sensibly at the shell prompt instead of inserting a raw escape like ;2;13~ or 1;2C. Covers Shift/Ctrl+Enter, Shift/Ctrl/Alt + arrows, Home/End and Delete (Ctrl+←/→ jump by word). Off by default. Doesn't affect Claude/Codex panes, which use these keys themselves.
zh_hans: 把按键绑定写到 ~/.config/glint/,并在 ~/.zshrc(以及存在的话 ~/.bashrc)里只加一行 source 引用,让带修饰键在 shell 提示符下表现正常,而不是插入像 ;2;13~ 或 1;2C 这样的原始转义。覆盖 Shift/Ctrl+Enter、Shift/Ctrl/Alt + 方向键、Home/End 和 Delete(Ctrl+←/→ 按词移动)。默认关闭。不影响 Claude/Codex 窗格(它们自己要用这些键)。

source: You're up to date.
zh_hans: 已是最新版本。

source: awaiting reply
zh_hans: 待回复

source: clean
zh_hans: 干净

source: compacting…
zh_hans: 压缩中…

source: done
zh_hans: 完成

source: error
zh_hans: 出错

source: needs approval
zh_hans: 等待批准

source: no cwd
zh_hans: 无目录

source: not a git repo
zh_hans: 不是 git 仓库

source: pane
zh_hans: 面板

source: panes
zh_hans: 面板

source: reply
zh_hans: 待回复

source: repo detected
zh_hans: 检测到仓库

source: running…
zh_hans: 运行中…

source: tabs
zh_hans: 标签页

source: thinking…
zh_hans: 思考中…

source: this branch
zh_hans: 该分支

source: ── session restored ──
zh_hans: ── 已恢复会话 ──

source: ✓ available
zh_hans: ✓ 可用

source: ✓ done
zh_hans: ✓ 已完成

source: ✗ exists
zh_hans: ✗ 已存在

source: ✗ invalid name
zh_hans: ✗ 名称非法
